In [1]:
import pandas as pd
print("Version",pd.__version__)

Version 2.2.3

In [5]:
a = [10, 20, 30, 40, 50, 60]
b = pd.Series(a)
print(b)
print(b[3])

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64
40

In [8]:
a = [30, 79, 43]
myvar = pd.Series(a, index = ["Rice", "Jaggery", "Vermicelli"])
print(myvar)
print(myvar["Rice"])

Rice          30
Jaggery       79
Vermicelli    43
dtype: int64
30

In [14]:
employee =  {
    "id" : 1,
    "name" : "Nisarga",
    "address" : "Nisarga@gmail.com",
    "Salary" : 457875967
}

data = pd.Series(employee)
print(data)
print("id", data["id"])

id                         1
name                 Nisarga
address    Nisarga@gmail.com
Salary             457875967
dtype: object
id 1

In [25]:
sample = {
    "id" : [1, 2, 3, 4,],
    "name" : ["A", "B", "C", "D"]
}
df = pd.DataFrame(sample)

print(df)
print(df.loc[0])
# print(df.iloc[0, 1])

   id name
0   1    A
1   2    B
2   3    C
3   4    D
id      1
name    A
Name: 0, dtype: object

# loc
Label-based: loc is used to access a group of rows and columns by labels or a boolean array.
Syntax: df.loc[row_label, column_label]

In [38]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [24, 27, 22, 32],
        'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}
df = pd.DataFrame(data)

# Access row with label 1 and columns 'Name' and 'Age'
print(df.loc[1, ['Name', 'Age']])

Name    Bob
Age      27
Name: 1, dtype: object

# iloc
Integer-based: iloc is used to access a group of rows and columns by integer positions (i.e., index-based).
Syntax: df.iloc[row_index, column_index]

In [37]:
sample = {
    "id" : [1, 2, 3, 4,],
    "name" : ["A", "B", "C", "D"]
}
df = pd.DataFrame(sample)

print(df)
print(df.loc[0]) #retrieves the first row by label.
print(df.iloc[0, 1])n#retrieves the element in the first row and second column by position.
print(df.loc[0]) #gives the same result as the first time.

   id name
0   1    A
1   2    B
2   3    C
3   4    D
id      1
name    A
Name: 0, dtype: object
A
id      1
name    A
Name: 0, dtype: object

In [42]:
sample = {
    "id" : [1, 2, 3, 4,],
    "name" : ["A", "B", "C", "D"]
}
df = pd.DataFrame(sample)

print(df)
print(df.loc[0]) #retrieves the first row by label.

   id name
0   1    A
1   2    B
2   3    C
3   4    D
id      1
name    A
Name: 0, dtype: object

In [44]:
sample = {
    "id" : [1, 2, 3, 4,],
    "name" : ["A", "B", "C", "D"]
}
df = pd.DataFrame(sample)

print(df)
print(df.iloc[0, 1])#retrieves the element in the first row and second column by position.  ->> row - 0 and column - 1

   id name
0   1    A
1   2    B
2   3    C
3   4    D
A

In [41]:
user_data = {
    "name" : [ "alex", "catty", "bob"],
    "age" : [23, 24, 25],
    "salary" : [4556, 7567, 57567],
    "email" : ["alex@gamil", "cat@gmail.com", "bob@gmail.com"]
}

df1 = pd.DataFrame(user_data)
print(df1)

    name  age  salary          email
0   alex   23    4556     alex@gamil
1  catty   24    7567  cat@gmail.com
2    bob   25   57567  bob@gmail.com

In [47]:
data = [
    ["Alice", 25, "New York"],
    ["Bob", 30, "Los Angeles"],
    ["Charlie", 35, "Chichago"],
    ["David", 40, "Houston"]
    ]
df = pd.DataFrame(data, columns = ["Name", "Age", "city"])
print(df)

      Name  Age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35     Chichago
3    David   40      Houston

In [48]:
df = pd.read_csv("MOCK_DATA.CSV")
print(df)

     id first_name   last_name                       email  gender    grade
0     1  Francisco        Lyne          flyne0@vinaora.com    Male  499.156
1     2      Kacey  Patrickson  kpatrickson1@webeden.co.uk  Female   68.877
2     3    Caddric        Ames           cames2@flavors.me    Male  731.864
3     4    Robinet    McGeorge      rmcgeorge3@oaic.gov.au  Female  620.213
4     5      Verge  Dracksford     vdracksford4@ebay.co.uk    Male  892.357
..  ...        ...         ...                         ...     ...      ...
95   96   Ignacius     Edmands     iedmands2n@illinois.edu    Male  481.876
96   97    Stavros      Daunay        sdaunay2o@scribd.com    Male  638.307
97   98    Damiano     Danelet           ddanelet2p@ft.com    Male  175.205
98   99      Adler        Teck              ateck2q@ft.com    Male  774.737
99  100    Dominic      Smylie         dsmylie2r@adobe.com    Male  450.091

[100 rows x 6 columns]

In [61]:
df.head()

   id first_name   last_name                       email  gender    grade
0   1  Francisco        Lyne          flyne0@vinaora.com    Male  499.156
1   2      Kacey  Patrickson  kpatrickson1@webeden.co.uk  Female   68.877
2   3    Caddric        Ames           cames2@flavors.me    Male  731.864
3   4    Robinet    McGeorge      rmcgeorge3@oaic.gov.au  Female  620.213
4   5      Verge  Dracksford     vdracksford4@ebay.co.uk    Male  892.357

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          100 non-null    int64
 1   first_name  100 non-null    object
 2   last_name   100 non-null    object
 3   email       100 non-null    object
 4   gender      100 non-null    object
 5   grade       100 non-null    float64
dtypes: float64(1), int64(1), object(4)
memory usage: 4.8+ KB

In [64]:
df.tail()

     id first_name last_name                    email gender    grade
95   96   Ignacius   Edmands  iedmands2n@illinois.edu   Male  481.876
96   97    Stavros    Daunay     sdaunay2o@scribd.com   Male  638.307
97   98    Damiano   Danelet        ddanelet2p@ft.com   Male  175.205
98   99      Adler      Teck           ateck2q@ft.com   Male  774.737
99  100    Dominic    Smylie      dsmylie2r@adobe.com   Male  450.091

In [65]:
df.describe()

               id       grade
count  100.000000  100.000000
mean    50.500000  513.033350
std     29.011492  273.268106
min      1.000000   35.536000
25%     25.750000  272.300000
50%     50.500000  527.085500
75%     75.250000  731.601500
max    100.000000  985.432000

In [58]:
print(df["id"])

0       1
1       2
2       3
3       4
4       5
     ...
95     96
96     97
97     98
98     99
99    100
Name: id, Length: 100, dtype: int64

In [66]:
df[["id", "first_name"]]

     id first_name
0     1  Francisco
1     2      Kacey
2     3    Caddric
3     4    Robinet
4     5      Verge
..  ...        ...
95   96   Ignacius
96   97    Stavros
97   98    Damiano
98   99      Adler
99  100    Dominic

[100 rows x 2 columns]

In [70]:
df.shape

(100, 6)

In [69]:
print(df.to_string())

     id first_name     last_name                                   email       gender    grade
0     1  Francisco          Lyne                      flyne0@vinaora.com         Male  499.156
1     2      Kacey    Patrickson              kpatrickson1@webeden.co.uk       Female   68.877
2     3    Caddric          Ames                       cames2@flavors.me         Male  731.864
3     4    Robinet      McGeorge                  rmcgeorge3@oaic.gov.au       Female  620.213
4     5      Verge    Dracksford                 vdracksford4@ebay.co.uk         Male  892.357
5     6     Darren      Scannell                  dscannell5@tinyurl.com         Male  660.925
6     7        Lin        Vieyra                lvieyra6@tripadvisor.com         Male  876.737
7     8   Vivyanne         Anand                    vanand7@multiply.com       Female  203.013
8     9    Everard        Curwen                    ecurwen8@weather.com         Male  478.570
9    10      Allyn      O' Ronan                     aoronan9@paypal.com       Female  657.031
10   11   Carlotta       Barling                  cbarlinga@china.com.cn  Genderfluid  478.783
11   12    Meridel       Primmer                        mprimmerb@go.com       Female  359.350
12   13    Marleah   Lethibridge             mlethibridgec@cafepress.com  Genderfluid   54.451
13   14      Megen      Bowskill                      mbowskilld@nih.gov       Female  503.966
14   15    Lisbeth    McTrustrie                lmctrustriee@t-online.de       Female  501.192
15   16  Sherlocke        Broker                  sbrokerf@princeton.edu     Bigender  731.514
16   17  Francesco     Beresford              fberesfordg@bravesites.com   Polygender  767.059
17   18     Gerrie     Armatidge             garmatidgeh@liveinternet.ru       Female  313.130
18   19        Way       Linnitt               wlinnitti@istockphoto.com         Male  760.756
19   20     Tommie       Cunradi                   tcunradij@yahoo.co.jp       Female  121.018
20   21      Cybil        Cameli                        ccamelik@mit.edu       Female  795.518
21   22     Vasily    Dundendale                 vdundendalel@hao123.com         Male  593.997
22   23       Chev         Apfel                     capfelm@sina.com.cn         Male  425.731
23   24       Luke       Undrill                 lundrilln@earthlink.net         Male  876.128
24   25   Berenice       Hayward                      bhaywardo@dell.com     Bigender  919.513
25   26     Elisha       Rumbold                      erumboldp@xing.com       Female  528.661
26   27      Cheri      Pickwell               cpickwellq@altervista.org       Female  729.595
27   28     Devlin       Rawdall                drawdallr@craigslist.org      Agender  581.918
28   29    Obadiah        Marlon                      omarlons@patch.com         Male  862.238
29   30     Milzie         Esley                    mesleyt@hubpages.com       Female  550.019
30   31      Shari      O'Dreain                   sodreainu@mozilla.com       Female  886.042
31   32    Brennen         Shank                         bshankv@home.pl         Male   87.018
32   33     Kellby  Van Der Walt           kvanderwaltw@businessweek.com         Male  696.534
33   34    Edeline         Cakes                  ecakesx@opensource.org       Female  764.944
34   35     Kesley        Rodden                        kroddeny@wsj.com       Female   37.016
35   36        Bud     Benedicto                       bbenedictoz@51.la         Male  147.000
36   37     Estele     Longlands                   elonglands10@etsy.com       Female  530.458
37   38       Dory         Prene                      dprene11@google.nl       Female  662.874
38   39     Reuven      Capehorn                   rcapehorn12@mysql.com         Male  980.027
39   40      Lilly      Cheltnam                lcheltnam13@symantec.com       Female  707.561
40   41      Daryn         Horry                     dhorry14@weebly.com       Female  355.708
41   42    Lorilyn       Teasell                  lteasell15@nbcnews.com       Female   71.586
42   43    Kalinda         Skipp                    kskipp16@vinaora.com       Female  525.510
43   44  Hyacintha     Clementel              hclementel17@over-blog.com       Female  247.804
44   45    Chelsie    Collacombe               ccollacombe18@weather.com       Female  646.039
45   46       Bern        Nolder                     bnolder19@google.de         Male  142.127
46   47      Davon         Towle                   dtowle1a@marriott.com         Male  651.072
47   48      Filia   Bricklebank              fbricklebank1b@harvard.edu       Female  480.785
48   49      Dotti       Chiplen               dchiplen1c@prnewswire.com       Female   97.980
49   50       Oran          Larn                   olarn1d@wordpress.com         Male  210.506
50   51     Connie      Murrigan                  cmurrigan1e@zimbio.com         Male  670.568
51   52  Marylinda       Denizet                     mdenizet1f@about.me       Female  474.955
52   53      Mindy     Everleigh               meverleigh1g@amazon.co.jp       Female  647.894
53   54  Gilemette        Parkey                    gparkey1h@cpanel.net       Female  143.404
54   55   Ludovika      Sherwood                     lsherwood1i@soup.io   Polygender  914.817
55   56     Donalt       Dalling          ddalling1j@businessinsider.com         Male  852.336
56   57   Hyacinth       Saywood               hsaywood1k@mayoclinic.com       Female  258.329
57   58   Clerissa      Gilloran                  cgilloran1l@forbes.com       Female  112.196
58   59    Alyosha    MacFarland              amacfarland1m@china.com.cn         Male  413.633
59   60     Veriee         Szach                     vszach1n@boston.com   Non-binary  177.013
60   61     Stormi          Lark                slark1o@businessweek.com       Female  276.957
61   62       Jeno        Beefon                 jbeefon1p@pinterest.com         Male  579.606
62   63   Terencio      Whitcomb               twhitcomb1q@webeden.co.uk         Male  625.696
63   64    Frannie     Millichap            fmillichap1r@bizjournals.com       Female  399.500
64   65        Bee        Cowsby                      bcowsby1s@live.com       Female  985.432
65   66   Parrnell         Stuer                      pstuer1t@youku.com         Male  629.456
66   67     Verena         Harms                       vharms1u@hibu.com       Female  393.251
67   68   Gonzales        Cleyne                gcleyne1v@techcrunch.com         Male  975.805
68   69      Mikol   Saundercock        msaundercock1w@cocolog-nifty.com         Male  832.979
69   70     Dallas          Beyn                      dbeyn1x@elpais.com         Male  205.941
70   71    Eleanor      Dickings               edickings1y@webeden.co.uk       Female   98.942
71   72      Jaine         Trank                          jtrank1z@is.gd  Genderfluid  693.009
72   73       Jock       Shannon                   jshannon20@utexas.edu         Male  947.893
73   74    Graehme          Pott                         gpott21@msu.edu         Male  815.495
74   75     Gideon      Gammidge                ggammidge22@bluehost.com         Male  202.734
75   76      Giffy      Davenell                 gdavenell23@oaic.gov.au      Agender  748.560
76   77      Carin        Joncic                    cjoncic24@flavors.me       Female  329.037
77   78      Hobey       Blenkin                    hblenkin25@tmall.com         Male  571.477
78   79      Julee        Badsey                   jbadsey26@mozilla.com       Female  466.987
79   80      Karil         Kaman                     kkaman27@forbes.com       Female  398.853
80   81     Marwin        Godman                mgodman28@soundcloud.com         Male  142.284
81   82     Kinnie         Nouch                  knouch29@clickbank.net         Male  873.977
82   83       Elia        Skyppe                 eskyppe2a@imageshack.us         Male  277.942
83   84       Gris    Barnewille                   gbarnewille2b@epa.gov         Male  552.316
84   85     Davide  Bickerstaffe  dbickerstaffe2c@scientificamerican.com         Male  423.922
85   86      Dolph      Adriaens                    dadriaens2d@gmpg.org         Male  139.519
86   87      Ozzie         Jeppe                     ojeppe2e@tripod.com         Male  938.771
87   88     Spence     Greenwell                  sgreenwell2f@exblog.jp         Male   35.536
88   89   Alasteir      Monteaux               amonteaux2g@wordpress.org         Male  878.819
89   90      Derry        Roache                     droache2h@nymag.com         Male  212.352
90   91  Sigismund      Pressdee           spressdee2i@sciencedirect.com         Male  434.213
91   92     Gibbie    Macconaghy              gmacconaghy2j@hubpages.com         Male  240.524
92   93    Marilyn      Brocking                mbrocking2k@japanpost.jp       Female  312.467
93   94     Shamus         Kikke                    skikke2l@dedecms.com         Male  805.589
94   95  Sebastien       Fairlaw                sfairlaw2m@bloomberg.com         Male  600.262
95   96   Ignacius       Edmands                 iedmands2n@illinois.edu         Male  481.876
96   97    Stavros        Daunay                    sdaunay2o@scribd.com         Male  638.307
97   98    Damiano       Danelet                       ddanelet2p@ft.com         Male  175.205
98   99      Adler          Teck                          ateck2q@ft.com         Male  774.737
99  100    Dominic        Smylie                     dsmylie2r@adobe.com         Male  450.091

In [71]:
df[["id", "first_name"]].head()

   id first_name
0   1  Francisco
1   2      Kacey
2   3    Caddric
3   4    Robinet
4   5      Verge

In [72]:
df["grade"].describe()

count    100.000000
mean     513.033350
std      273.268106
min       35.536000
25%      272.300000
50%      527.085500
75%      731.601500
max      985.432000
Name: grade, dtype: float64